OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI_USPI.c
/*
 * Copyright (c) 2013-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* Driver_SPI.c - CMSIS-Driver for Nuvoton USCI_SPI */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* Project can define PRJ_RTE_DEVICE_HEADER macro to include private or global RTE_Device.h. */
#ifdef   PRJ_RTE_DEVICE_HEADER
    #include PRJ_RTE_DEVICE_HEADER
#else
    #include "../RTE_Device/RTE_Device.h"
#endif

#include "Driver_SPI.h"
#include "drv_pdma.h"
#include "NuMicro.h"
#include "spi_hal.h"

//------------------------------------------------------------------------------
#define RTE_SPI_USPI0                   RTE_SPI7
//#define RTE_SPI_USPI1                   RTE_SPIx

// Configuration depending on RTE_SPI.h
// Check if at least one peripheral instance is configured in RTE_SPI.h
#if (!(RTE_SPI_USPI0) && !(RTE_SPI_USPI1))
    //#warning  SPI driver requires at least one SPI peripheral configured in RTE_SPI.h
#else
    #define DRIVER_CONFIG_VALID     1
#endif

// *****************************************************************************

#ifdef DRIVER_CONFIG_VALID     // Driver code is available only if configuration is valid

#if (RTE_SPI_USPI0 == 1)
    #define SPI_USPI_IDX0               7
    #define SPI_USPI_PORT0              0
    #define USPI_PORTSYM_FROM_RTE_7     SPI_USPI_PORT0
#endif

#if (RTE_SPI_USPI1 == 1)
    #define SPI_USPI_IDX1               8
    #define SPI_USPI_PORT1              1
    #define USPI_PORTSYM_FROM_RTE_8     SPI_USPI_PORT1
#endif

static inline uint32_t spi_idx_from_port_rt(uint32_t n)
{
    switch (n)
    {
#if (RTE_SPI_USPI0 == 1)

        case SPI_USPI_IDX0:
            return SPI_USPI_PORT0;
#endif

#if (RTE_SPI_USPI1 == 1)

        case SPI_USPI_IDX1:
            return SPI_USPI_PORT1;
#endif

        default:
            return 0;
    }
}

#define USPI_IDX_FROM_PORT_CAT(x)        USPI_PORTSYM_FROM_RTE_##x
#define USPI_IDX_FROM_PORT(x)            USPI_IDX_FROM_PORT_CAT(x)

#define SPI_TO_USPI_INSTANCE(n)          ( spi_idx_from_port_rt((uint32_t)(n)) )
#define SPI_TO_USPI(n)                   ( SPI_CONCAT2(USPI, USPI_IDX_FROM_PORT(n)) )

#define SPI_TO_USPI_PDMA_RX(n)           ( SPI_CONCAT3(RTE_USPI, USPI_IDX_FROM_PORT(n), _RX_PDMA) )
#define SPI_TO_USPI_PDMA_TX(n)           ( SPI_CONCAT3(RTE_USPI, USPI_IDX_FROM_PORT(n), _TX_PDMA) )
#define SPI_TO_USPI_PDMA_RX_PORT(n)      ( SPI_CONCAT3(RTE_USPI, USPI_IDX_FROM_PORT(n), _RX_PDMA_PORT) )
#define SPI_TO_USPI_PDMA_TX_PORT(n)      ( SPI_CONCAT3(RTE_USPI, USPI_IDX_FROM_PORT(n), _TX_PDMA_PORT) )
#define SPI_TO_USPI_PDMA_RX_CH(n)        ( SPI_CONCAT3(RTE_USPI, USPI_IDX_FROM_PORT(n), _RX_PDMA_CHANNEL) )
#define SPI_TO_USPI_PDMA_TX_CH(n)        ( SPI_CONCAT3(RTE_USPI, USPI_IDX_FROM_PORT(n), _TX_PDMA_CHANNEL) )

#define SPI_TO_USPI_PDMA_RX_NUM(n)       ( SPI_CONCAT3(PDMA_USCI, USPI_IDX_FROM_PORT(n), _RX) )
#define SPI_TO_USPI_PDMA_TX_NUM(n)       ( SPI_CONCAT3(PDMA_USCI, USPI_IDX_FROM_PORT(n), _TX) )

// Local driver functions declarations (for instances)
#define SPI_INFO_DEFINE(n)                                                     \
    static SPI_RESOURCES SPI_RES_NAME(n) = { SPI_TO_USPI(n),                   \
                                             { \
                                               0,                              \
                                               0,                              \
                                             },                                \
                                             {0},                              \
                                             {0},                              \
                                             {-1,                              \
                                              -1,                              \
                                              SPI_TO_USPI_PDMA_RX(n),          \
                                              SPI_TO_USPI_PDMA_TX(n),          \
                                              SPI_TO_USPI_PDMA_RX_PORT(n),     \
                                              SPI_TO_USPI_PDMA_TX_PORT(n),     \
                                              SPI_TO_USPI_PDMA_RX_CH(n),       \
                                              SPI_TO_USPI_PDMA_TX_CH(n),       \
                                              SPI_TO_USPI_PDMA_RX_NUM(n),      \
                                              SPI_TO_USPI_PDMA_TX_NUM(n),      \
                                             }                                 \
                                           };

// Local driver functions declarations (for instances)
#if (RTE_SPI_USPI0 == 1)
    SPI_INFO_DEFINE(SPI_USPI_IDX0)
#endif

#if (RTE_SPI_USPI1 == 1)
    SPI_INFO_DEFINE(SPI_USPI_IDX1)
#endif

// List of available SPI instance infos
static const SPI_RESOURCES *const spi_res_list[] =
{
#if defined(RTE_SPI_USPI0) && (RTE_SPI_USPI0 == 1)
    &SPI_RES_NAME(SPI_USPI_IDX0),
#else
    NULL,
#endif

#if defined(RTE_SPI_USPI1) && (RTE_SPI_USPI1 == 1)
    &SPI_RES_NAME(SPI_USPI_IDX1),
#else
    NULL,
#endif

    NULL,
};

/* Local Functions */
static ARM_DRIVER_VERSION SPIn_GetVersion(void);
static ARM_SPI_CAPABILITIES SPIn_GetCapabilities(void);
static int32_t SPIn_Initialize(uint32_t u32Inst, ARM_SPI_SignalEvent_t cb_event);
static int32_t SPIn_Uninitialize(uint32_t u32Inst);
static int32_t SPIn_PowerControl(uint32_t u32Inst, ARM_POWER_STATE state);
static int32_t SPIn_Send(uint32_t u32Inst, const void *pvTxData, uint32_t u32Size);
static int32_t SPIn_Receive(uint32_t u32Inst, void *pvRxData, uint32_t u32Size);
static int32_t SPIn_Transfer(uint32_t u32Inst, const void *data_out, void *data_in, uint32_t num);
static uint32_t SPIn_GetDataCount(uint32_t u32Inst);
static int32_t SPIn_Control(uint32_t u32Inst, uint32_t control, uint32_t arg);
static ARM_SPI_STATUS SPIn_GetStatus(uint32_t u32Inst);

