OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI_USPI.c
static void SPI_PDMA_TXInit(SPI_RESOURCES *pSPIn);
static void SPI_PDMA_RXInit(SPI_RESOURCES *pSPIn);

#if (RTE_SPI_USPI0 == 1)
    FUNCS_DECLARE(SPI_USPI_IDX0)
#endif

#if (RTE_SPI_USPI1 == 1)
    FUNCS_DECLARE(SPI_USPI_IDX1)
#endif

//------------------------------------------------------------------------------

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion =
{
    ARM_SPI_API_VERSION,
    0x100
};

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities =
{
    1U,  // Simplex Mode (Master and Slave)
    0U,  // TI Synchronous Serial Interface
    0U,  // Microwire Interface
    1U,  // Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT
    0U   // Reserved
};

//------------------------------------------------------------------------------
static void SPI_PDMA_CB_Handler(void *ptr_priv, uint32_t u32Event)
{
    // Wait for SPI to become idle
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)ptr_priv;
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;
    volatile int32_t i32TimeoutCnt = SystemCoreClock / 1000;

    while ((USPI_IS_BUSY(phspi) != 0) && (--i32TimeoutCnt >= 0)) {}

    if (u32Event & (NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_ABORT))
    {
        if (u32Event & (NU_PDMA_EVENT_TRANSFER_DONE))
        {
            USPI_ClearIntFlag(phspi, USPI_RXEND_INT_MASK | USPI_TXEND_INT_MASK); // Clear RX FIFO time-out and TX FIFO threshold interrupt flags

            // All transfers completed
            pSPIn->sXfer.u32TxCnt = pSPIn->sXfer.u32RxCnt = pSPIn->sXfer.u32Num;

            pSPIn->sState.sDrvStatus.u8Busy = 0U;

            // Call the event callback if it is registered
            if (pSPIn->sState.cb_event)
            {
                pSPIn->sState.cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
            }
        }
        else
        {
            if (pSPIn->sXfer.pu8RxBuf != NULL)
            {
                // Partial transfer completed
                pSPIn->sXfer.u32RxCnt = nu_pdma_transferred_byte_get(pSPIn->spdma.i32RxChnId,
                                                                     pSPIn->sXfer.u32Num);
            }
            else
            {
                // Partial transfer completed
                pSPIn->sXfer.u32TxCnt = nu_pdma_transferred_byte_get(pSPIn->spdma.i32RxChnId,
                                                                     pSPIn->sXfer.u32Num);
            }
        }

        // Disable SPI TX/RX PDMA function
        USPI_DISABLE_TX_RX_PDMA(phspi);
    }
}

/**
 * @brief Kicks off the first transmission for the SPI driver.
 *
 * This function is responsible for initiating the first transmission for the SPI driver.
 *
 * @param pSPIn Pointer to the SPI_RESOURCES structure.
 */
static void SPI_KickFirstTx(SPI_RESOURCES *pSPIn)
{
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = (phspi->LINECTL & USPI_LINECTL_DWIDTH_Msk) >> USPI_LINECTL_DWIDTH_Pos;
    uint32_t u32PatternMask = ((u32DataBits == 0) ? 0xFFFF : (0xFFFF >> (16 - u32DataBits)));
    uint8_t *pu8TxBuf = pSPIn->sXfer.pu8TxBuf;
    uint16_t *pu16TxBuf = (uint16_t *)pSPIn->sXfer.pu8TxBuf;
    uint32_t u32TxData = 0;

    // Check TX FIFO not full and there's data left to send
    if ((!USPI_GET_TX_FULL_FLAG(phspi)) &&
            (pSPIn->sXfer.u32TxCnt < pSPIn->sXfer.u32Num))
    {
        if (pu8TxBuf == NULL)
        {
            u32TxData = pSPIn->sXfer.u32DefVal;
        }
        else
        {
            // Retrieve data and mask accurately based on DataBits.
            if ((u32DataBits <= 8) && (u32DataBits > 0))
            {
                u32TxData = (uint8_t)(pu8TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
            else
            {
                u32TxData = (uint16_t)(pu16TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
        }

        phspi->TXDAT = (u32TxData & u32PatternMask);
        pSPIn->sXfer.u32TxCnt++;

        USPI_ClearIntFlag(phspi, USPI_TXEND_INT_MASK);
    }
}

static inline void SPI_StoreRxData(SPI_RESOURCES *pSPIn, uint32_t u32RxData, uint32_t u32DataBits)
{
    uint32_t index = pSPIn->sXfer.u32RxCnt;

    if (pSPIn->sXfer.pu8RxBuf == NULL) return;  // Dummy read case

    if ((u32DataBits <= 8) && (u32DataBits > 0))
    {
        pSPIn->sXfer.pu8RxBuf[index] = (uint8_t)u32RxData;
    }
    else
    {
        ((uint16_t *)pSPIn->sXfer.pu8RxBuf)[index] = (uint16_t)u32RxData;
    }
}

static void SPI_RxIRQHandler(uint32_t u32Inst, uint32_t u32DataBits, uint32_t u32PatternMask)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];
    USPI_T *phspi = pSPIn->phspi;
    uint32_t au32RxBuf[8] = {0};  // Local temporary buffer for batch RX from FIFO
    uint32_t u32Count = 0, u32i = 0;

    // Step 1: Batch read all available data from RX FIFO (store raw data first)
    while (!USPI_GET_RX_EMPTY_FLAG(phspi) &&
            (u32Count < SPI_ARRAY_SIZE(au32RxBuf)) &&
            ((pSPIn->sXfer.u32RxCnt + u32Count) < pSPIn->sXfer.u32Num))
    {
        au32RxBuf[u32Count++] = USPI_READ_RX(phspi);
    }

    // Step 2: Process DataBits conversion after raw data is fetched
    for (u32i = 0; u32i < u32Count; u32i++)
    {
        uint32_t raw = au32RxBuf[u32i] & u32PatternMask;
        SPI_StoreRxData(pSPIn, raw, u32DataBits);
        pSPIn->sXfer.u32RxCnt++;
    }
}

static void SPI_TxIRQHandler(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;

    // Half-Duplex mode handling TX
    if ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) &&
            (pSPIn->sXfer.pu8TxBuf == NULL))
    {
        return;
    }

    // Check TX FIFO not full and there's data left to send
    SPI_KickFirstTx(pSPIn);

    // Transmission completed, disable interrupt
    if ((USPI_IS_BUSY(phspi) == 0) && (pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num))
    {
        USPI_ClearIntFlag(phspi, USPI_TXEND_INT_MASK);
        USPI_DisableInt(phspi, USPI_TXEND_INT_MASK); // Disable TX FIFO threshold interrupt
    }
}

// SPI interrupt handler
static void SPI_IRQHandler(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = ((phspi->LINECTL & USPI_LINECTL_DWIDTH_Msk) >> USPI_LINECTL_DWIDTH_Pos);
    uint32_t u32PatternMask = (u32DataBits == 0) ? 0xFFFF : (0xFFFF >> (16 - u32DataBits));

