OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI_USPI.c
    // Check if SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if SPI is busy
    if (pSPIn->sState.sDrvStatus.u8Busy)
    {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Set SPI as busy
    pSPIn->sState.sDrvStatus.u8Busy = 1U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Set data buffers and transfer count
    pSPIn->sXfer.pu8RxBuf = (uint8_t *)data;
    pSPIn->sXfer.pu8TxBuf = NULL;

    pSPIn->sXfer.u32Num = num;
    pSPIn->sXfer.u32RxCnt = 0U;
    pSPIn->sXfer.u32TxCnt = 0U;

    if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
    {
        phspi->PROTCTL = ((phspi->PROTCTL & ~(USPI_PROTCTL_TSMSEL_Msk)) |
                          (4 << USPI_PROTCTL_TSMSEL_Pos));
    }

    if (pSPIn->spdma.i32RxChnId != -1)
    {
        SPI_PDMA_RXInit(pSPIn);
        /* Enable SPI master DMA function */
        USPI_TRIGGER_RX_PDMA(phspi);
    }
    else
    {
        USPI_ClearIntFlag(phspi, USPI_TXEND_INT_MASK | USPI_RXEND_INT_MASK);

        /* Set TX FIFO threshold, enable TX FIFO threshold interrupt and RX FIFO time-out interrupt */
        USPI_EnableInt(phspi,
                       ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) ?
                        USPI_RXEND_INT_MASK :
                        (USPI_TXEND_INT_MASK | USPI_RXEND_INT_MASK)));
        SPI_KickFirstTx(pSPIn);
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Transfer (const void     *data_out,
                                            void    *data_in,
                                            uint32_t num)
  \brief       Start sending/receiving data to/from SPI transmitter/receiver.
  \param[in]   data_out  Pointer to buffer with data to send to SPI transmitter
  \param[out]  data_in   Pointer to buffer for data to receive from SPI receiver
  \param[in]   num       Number of data items to transfer
  \return      \ref execution_status
*/
static int32_t SPIn_Transfer(uint32_t u32Inst, const void *data_out, void *data_in, uint32_t num)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;

    // Check for valid parameters
    if ((data_out == NULL) || (data_in == NULL) || (num == 0U))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Check if SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if SPI is busy
    if (pSPIn->sState.sDrvStatus.u8Busy)
    {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Set SPI as busy
    pSPIn->sState.sDrvStatus.u8Busy = 1U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Set data buffers and transfer count
    pSPIn->sXfer.pu8RxBuf = (uint8_t *)data_in;
    pSPIn->sXfer.pu8TxBuf = (uint8_t *)(uint32_t)data_out;
    pSPIn->sXfer.u32Num = num;
    pSPIn->sXfer.u32RxCnt = 0U;
    pSPIn->sXfer.u32TxCnt = 0U;

    // **Support Half-Duplex mode**
    if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
    {
        phspi->PROTCTL = ((phspi->PROTCTL & ~(USPI_PROTCTL_TSMSEL_Msk)) |
                          (4 << USPI_PROTCTL_TSMSEL_Pos));

        if (data_out && !data_in)
        {
            phspi->CTL |= SPI_CTL_DATDIR_Msk; // Set TX mode
        }
        else if (data_in && !data_out)
        {
            phspi->CTL &= ~SPI_CTL_DATDIR_Msk; // Set RX mode
        }
        else
        {
            return ARM_DRIVER_ERROR_PARAMETER; // In Half-Duplex mode, cannot perform TX and RX simultaneously
        }
    }

    // Initialize and trigger PDMA if available
    if (pSPIn->spdma.i32RxChnId != -1)
    {
        if (data_in && !data_out)  // **Half-Duplex RX Mode**
        {
            SPI_PDMA_RXInit(pSPIn);
            USPI_TRIGGER_RX_PDMA(phspi);
        }
        else if (data_out && !data_in)  // **Half-Duplex TX Mode**
        {
            SPI_PDMA_TXInit(pSPIn);
            USPI_TRIGGER_TX_PDMA(phspi);
        }
        else  // **Full-Duplex Mode**
        {
            SPI_PDMA_RXInit(pSPIn);
            SPI_PDMA_TXInit(pSPIn);
            USPI_TRIGGER_TX_RX_PDMA(phspi);
        }
    }
    else
    {
        USPI_ClearIntFlag(phspi, USPI_TXEND_INT_MASK | USPI_RXEND_INT_MASK);

        // Set TX FIFO threshold, enable TX FIFO threshold interrupt and RX FIFO time-out interrupt
        if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
        {
            if (data_out && !data_in)  // **Half-Duplex TX Mode**
            {
                USPI_EnableInt(phspi, USPI_TXEND_INT_MASK);
            }
            else if (data_in && !data_out)  // **Half-Duplex RX Mode**
            {
                USPI_EnableInt(phspi, USPI_RXEND_INT_MASK);
            }
        }
        else  // **Full-Duplex Mode**
        {
            USPI_EnableInt(phspi, USPI_TXEND_INT_MASK | USPI_RXEND_INT_MASK);
        }

        SPI_KickFirstTx(pSPIn);
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t SPI_GetDataCount (void)
  \brief       Get transferred data count.
  \return      number of data items transferred
*/
static uint32_t SPIn_GetDataCount(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];

    // Check if the SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return 0U;
    }

    // If Rx buffer is used → Return RxCnt
    if (pSPIn->sXfer.pu8RxBuf != NULL)
    {
        if (pSPIn->spdma.i32RxChnId != -1)
        {
            pSPIn->sXfer.u32RxCnt = nu_pdma_transferred_byte_get(
                                        pSPIn->spdma.i32RxChnId, pSPIn->sXfer.u32Num);
        }

        return pSPIn->sXfer.u32RxCnt;
    }
    else // Else fallback to TxCnt
    {
        if (pSPIn->spdma.i32TxChnId != -1)
        {
            pSPIn->sXfer.u32TxCnt = nu_pdma_transferred_byte_get(
                                        pSPIn->spdma.i32TxChnId, pSPIn->sXfer.u32Num);
        }

        return pSPIn->sXfer.u32TxCnt;
    }
}

static int32_t SPIn_Control(uint32_t u32Inst, uint32_t control, uint32_t arg)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;
    uint32_t u32DataBits;

    if (!(pSPIn->sState.u8State & SPI_POWERED))
    {
        return ARM_DRIVER_ERROR;
    }

