OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI_USPI.c
    if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_ABORT_TRANSFER)
    {
        if (pSPIn->spdma.i32TxChnId != -1)
            nu_pdma_channel_terminate(pSPIn->spdma.i32TxChnId);

        if (pSPIn->spdma.i32RxChnId != -1)
            nu_pdma_channel_terminate(pSPIn->spdma.i32RxChnId);

        USPI_DisableInt(phspi, USPI_TXEND_INT_MASK | USPI_RXEND_INT_MASK);
        memset(&pSPIn->sXfer, 0, sizeof(SPI_TRANSFER_INFO));
        pSPIn->sState.sDrvStatus.u8Busy = 0U;

        return ARM_DRIVER_OK;
    }

    /* Enable USCI_SPI protocol */
    phspi->CTL = ((phspi->CTL & ~(USPI_CTL_FUNMODE_Msk)) |
                  (1ul << USPI_CTL_FUNMODE_Pos));

    // Process according to the operation command
    switch (control & ARM_SPI_CONTROL_Msk)
    {
        case ARM_SPI_MODE_INACTIVE:
            pSPIn->sState.u32Mode &= ~ARM_SPI_CONTROL_Msk;
            pSPIn->sState.u32Mode |= ARM_SPI_MODE_INACTIVE;
            phspi->PROTCTL &= ~USPI_PROTCTL_PROTEN_Msk;
            pSPIn->sState.u8State &= ~SPI_CONFIGURED;
            return ARM_DRIVER_OK;

        case ARM_SPI_MODE_MASTER:
        case ARM_SPI_MODE_SLAVE:
        {
            // Stop SPI and wait for SPIENSTS to be cleared
            phspi->PROTCTL &= ~USPI_PROTCTL_PROTEN_Msk;

            // Clear control settings
            phspi->LINECTL = 0;
            phspi->PROTCTL = 0;
            phspi->BRGEN = 0;

            if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER)
            {
                phspi->PROTCTL |= USPI_MASTER;
                phspi->LINECTL |= USPI_LINECTL_CTLOINV_Msk;
                pSPIn->sState.u32Mode &= ~ARM_SPI_CONTROL_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_MODE_MASTER;
                goto set_speed;
            }
            else
            {
                phspi->PROTCTL |= SPI_SLAVE;
                phspi->CTLIN0 |= USPI_CTLIN0_ININV_Msk;
                phspi->BRGEN = ((phspi->BRGEN & ~(USPI_BRGEN_CLKDIV_Msk)) |
                                (2 << USPI_BRGEN_CLKDIV_Pos));

                if (pSPIn->sConfig.u32XferMode == RTE_SPI_3WIRE_XFER_MODE)
                {
                    USPI_ENABLE_3WIRE_MODE(phspi);
                }

                pSPIn->sState.u32Mode &= ~ARM_SPI_CONTROL_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_MODE_SLAVE;
                break;
            }
        }

        case ARM_SPI_SET_BUS_SPEED:
set_speed:
            pSPIn->sConfig.u32BusSpeed = USPI_SetBusClock(phspi, arg);

            if (pSPIn->sConfig.u32BusSpeed == 0)
                return ARM_DRIVER_ERROR;

            if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_SET_BUS_SPEED)
                return ARM_DRIVER_OK;

            break;

        case ARM_SPI_GET_BUS_SPEED:
            return pSPIn->sConfig.u32BusSpeed;

        case ARM_SPI_SET_DEFAULT_TX_VALUE:
            pSPIn->sXfer.u32DefVal = arg;
            return ARM_DRIVER_OK;

        case ARM_SPI_CONTROL_SS:
            if ((arg != ARM_SPI_SS_ACTIVE) && (arg != ARM_SPI_SS_INACTIVE))
            {
                return ARM_DRIVER_ERROR_PARAMETER;
            }

            if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER &&
                    (pSPIn->sState.u32Mode & ARM_SPI_SS_MASTER_MODE_Msk) == ARM_SPI_SS_MASTER_SW)
            {

                USPI_DisableAutoSS(phspi);

                if (arg == ARM_SPI_SS_INACTIVE)
                {
                    USPI_SET_SS_HIGH(phspi);
                }
                else
                {
                    USPI_SET_SS_LOW(phspi);
                }

                return ARM_DRIVER_OK;
            }

            if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE &&
                    (pSPIn->sState.u32Mode & ARM_SPI_SS_SLAVE_MODE_Msk) == ARM_SPI_SS_SLAVE_SW)
            {

                USPI_DisableAutoSS(phspi);

                if (arg == ARM_SPI_SS_INACTIVE)
                {
                    USPI_SET_SS_HIGH(phspi);
                }
                else
                {
                    USPI_SET_SS_LOW(phspi);
                }

                return ARM_DRIVER_OK;
            }

            return ARM_DRIVER_ERROR;

        default:
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    // SS Master mode configuration
    if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER)
    {
        switch (control & ARM_SPI_SS_MASTER_MODE_Msk)
        {
            case ARM_SPI_SS_MASTER_UNUSED:
                USPI_DisableAutoSS(phspi);
                USPI_ENABLE_3WIRE_MODE(phspi);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_MASTER_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_MASTER_UNUSED;
                break;

            case ARM_SPI_SS_MASTER_HW_INPUT:
                return ARM_SPI_ERROR_SS_MODE;

            case ARM_SPI_SS_MASTER_SW:
                USPI_DisableAutoSS(phspi);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_MASTER_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_MASTER_SW;
                break;

            case ARM_SPI_SS_MASTER_HW_OUTPUT:
                USPI_EnableAutoSS(phspi, USPI_SS, USPI_SS_ACTIVE_LOW);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_MASTER_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_MASTER_HW_OUTPUT;
                break;

            default:
                break;
        }
    }

    // SS Slave mode configuration
    if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE)
    {
        switch (control & ARM_SPI_SS_SLAVE_MODE_Msk)
        {
            case ARM_SPI_SS_SLAVE_HW:
                USPI_EnableAutoSS(phspi, USPI_SS, USPI_SS_ACTIVE_LOW);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_SLAVE_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_SLAVE_HW;
                break;

            case ARM_SPI_SS_SLAVE_SW:
                if ((arg != ARM_SPI_SS_ACTIVE) && (arg != ARM_SPI_SS_INACTIVE))
                {
                    return ARM_DRIVER_ERROR_PARAMETER;
                }

                USPI_DisableAutoSS(phspi);

