OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI_USPI.c
                if (arg == ARM_SPI_SS_INACTIVE)
                {
                    USPI_SET_SS_HIGH(phspi);
                }
                else
                {
                    USPI_SET_SS_LOW(phspi);
                }

                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_SLAVE_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_SLAVE_SW;
                break;
        }
    }

    // Frame Format
    switch (control & ARM_SPI_FRAME_FORMAT_Msk)
    {
        case ARM_SPI_CPOL0_CPHA0:
            phspi->PROTCTL = ((phspi->PROTCTL & ~(USPI_PROTCTL_SCLKMODE_Msk)) | USPI_MODE_0);
            break;

        case ARM_SPI_CPOL0_CPHA1:
            phspi->PROTCTL = ((phspi->PROTCTL & ~(USPI_PROTCTL_SCLKMODE_Msk)) | USPI_MODE_1);
            break;

        case ARM_SPI_CPOL1_CPHA0:
            phspi->PROTCTL = ((phspi->PROTCTL & ~(USPI_PROTCTL_SCLKMODE_Msk)) | USPI_MODE_2);
            break;

        case ARM_SPI_CPOL1_CPHA1:
            phspi->PROTCTL = ((phspi->PROTCTL & ~(USPI_PROTCTL_SCLKMODE_Msk)) | USPI_MODE_3);
            break;

        default:
            return ARM_SPI_ERROR_FRAME_FORMAT;
    }

    // Data Bits
    u32DataBits = ((control & ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos);

    if ((u32DataBits > 0) && (u32DataBits < 4))
    {
        return ARM_SPI_ERROR_DATA_BITS;
    }

    phspi->LINECTL = ((phspi->LINECTL & ~(USPI_LINECTL_DWIDTH_Msk)) |
                      (((u32DataBits >= 16) ? 0 : u32DataBits) << USPI_LINECTL_DWIDTH_Pos));

    // MSB / LSB First
    if ((control & ARM_SPI_BIT_ORDER_Msk) == ARM_SPI_LSB_MSB)
    {
        USPI_SET_LSB_FIRST(phspi);
    }
    else
    {
        USPI_SET_MSB_FIRST(phspi);
    }

    // Clear RX & TX FIFOs
    USPI_ClearRxBuf(phspi);
    USPI_ClearTxBuf(phspi);

    // Enable SPI if needed
    if (pSPIn->sState.u8State & SPI_POWERED)
    {
        phspi->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;
    }

    pSPIn->sState.u8State |= SPI_CONFIGURED;

    return ARM_DRIVER_OK;
}

/**
  \fn          ARM_SPI_STATUS SPI_GetStatus (void)
  \brief       Get SPI status.
  \return      SPI status \ref ARM_SPI_STATUS
*/
static ARM_SPI_STATUS SPIn_GetStatus(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_USPI_INSTANCE(u32Inst)];
    ARM_SPI_STATUS status = {0};

    status.busy = pSPIn->sState.sDrvStatus.u8Busy;
    status.data_lost = pSPIn->sState.sDrvStatus.u8DataLost;
    status.mode_fault = pSPIn->sState.sDrvStatus.u8ModeFault;

    return (status);
}

static void SPI_PDMA_TXInit(SPI_RESOURCES *pSPIn)
{
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = ((phspi->CTL & (SPI_CTL_DWIDTH_Msk)) >> SPI_CTL_DWIDTH_Pos);

    //Use PDMA transfer mode
    struct nu_pdma_chn_cb pdma_chn_cb;

    pdma_chn_cb.m_eCBType = eCBType_Event;
    pdma_chn_cb.m_pfnCBHandler = SPI_PDMA_CB_Handler;
    pdma_chn_cb.m_pvUserData = (void *)pSPIn;

    //Use PDMA transfer mode
    nu_pdma_filtering_set(pSPIn->spdma.i32TxChnId, NU_PDMA_EVENT_TRANSFER_DONE);
    nu_pdma_callback_register(pSPIn->spdma.i32TxChnId, &pdma_chn_cb);
    nu_pdma_transfer(
        pSPIn->spdma.i32TxChnId,
        ((u32DataBits <= 8) && (u32DataBits > 0))                          ? 8
        : ((u32DataBits > 8) && (u32DataBits <= 16))                       ? 16
        : ((u32DataBits > 16) && ((u32DataBits < 32) || (u32DataBits == 0))) ? 32
        : 8,
        (uint32_t)pSPIn->sXfer.pu8TxBuf,
        (uint32_t)&phspi->TXDAT,
        pSPIn->sXfer.u32Num,
        0);
}

static void SPI_PDMA_RXInit(SPI_RESOURCES *pSPIn)
{
    USPI_T *phspi = (USPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = ((phspi->CTL & (SPI_CTL_DWIDTH_Msk)) >> SPI_CTL_DWIDTH_Pos);
    //Use PDMA transfer mode
    struct nu_pdma_chn_cb pdma_chn_cb;

    pdma_chn_cb.m_eCBType = eCBType_Event;
    pdma_chn_cb.m_pfnCBHandler = SPI_PDMA_CB_Handler;
    pdma_chn_cb.m_pvUserData = (void *)pSPIn;

    //Use PDMA transfer mode
    nu_pdma_filtering_set(pSPIn->spdma.i32RxChnId, NU_PDMA_EVENT_TRANSFER_DONE);
    nu_pdma_callback_register(pSPIn->spdma.i32RxChnId, &pdma_chn_cb);
    nu_pdma_transfer(
        pSPIn->spdma.i32RxChnId,
        ((u32DataBits <= 8) && (u32DataBits > 0))                          ? 8
        : ((u32DataBits > 8) && (u32DataBits <= 16))                       ? 16
        : ((u32DataBits > 16) && ((u32DataBits < 32) || (u32DataBits == 0))) ? 32
        : 8,
        (uint32_t)&phspi->RXDAT,
        (uint32_t)pSPIn->sXfer.pu8RxBuf,
        pSPIn->sXfer.u32Num,
        0);
}

// Local driver functions definitions (for instances)
// Information definitions (for instances)
#if (RTE_SPI_USPI0 == 1)
FUNCS_DEFINE(SPI_USPI_IDX0)
SPI_DRIVER(SPI_USPI_IDX0)

NVT_ITCM void USCI0_IRQHandler(void)
{
    SPI_IRQHandler(SPI_USPI_IDX0);
}
#endif

#if (RTE_SPI_USPI1 == 1)
FUNCS_DEFINE(SPI_USPI_IDX1)
SPI_DRIVER(SPI_USPI_IDX1)

NVT_ITCM void USCI1_IRQHandler(void)
{
    SPI_IRQHandler(SPI_USPI_IDX1);
}
#endif

#endif //DRIVER_CONFIG_VALID
